# Connect to the Chinook Database

In [4]:
#import psycopg2
import sqlalchemy
# we will want Pandas for the data frame structure
import pandas as pd

In [5]:
# use user bob
engine=sqlalchemy.create_engine('postgresql://bob:pwd1@localhost:5432/bank')

In [14]:
# Checking to see if I connected to database
pd.read_sql_query("SELECT table_name  FROM information_schema.tables LIMIT 15;",engine)

          table_name
0            account
1            pg_type
2             branch
3           business
4           customer
5         department
6           employee
7         individual
8            officer
9            product
10       transaction
11  pg_foreign_table
12          pg_roles
13       pg_settings
14          schemata

# Exercise 3-1 
Retrieve the employee ID, first name, and last name for all bank employees. Sort by last
name and then by first name.

In [15]:
pd.read_sql_query("""SELECT emp_id, fname, lname 
                     FROM employee 
                     ORDER BY lname, fname;""",engine)

    emp_id     fname      lname
0        2     Susan     Barker
1       13      John      Blake
2        6     Helen    Fleming
3       17      Beth     Fowler
4        5      John    Gooding
5        9      Jane   Grossman
6        4     Susan  Hawthorne
7       12  Samantha    Jameson
8       16   Theresa    Markham
9       14     Cindy      Mason
10       8     Sarah     Parker
11      15     Frank    Portman
12      10     Paula    Roberts
13       1   Michael      Smith
14       7     Chris     Tucker
15      18      Rick     Tulman
16       3    Robert      Tyler
17      11    Thomas    Ziegler

# Exercise 3-2
Retrieve the account ID, customer ID, and available balance for all accounts whose
status equals 'ACTIVE' and whose available balance is greater than $2,500.

In [16]:
pd.read_sql_query("""SELECT account_id, cust_id, avail_balance 
                     FROM account
                     WHERE (status = 'ACTIVE') AND avail_balance > 2500;""", engine)

   account_id  cust_id  avail_balance
0           3        1        3000.00
1          12        4        5487.09
2          15        6       10000.00
3          17        7        5000.00
4          18        8        3487.19
5          22        9        9345.55
6          24       10       23575.12
7          27       11        9345.55
8          28       12       38552.05
9          29       13       50000.00

# Exercise 3-3
Write a query against the account table that returns the IDs of the employees who
opened the accounts (use the account.open_emp_id column). Include a single row for
each distinct employee.

In [19]:
pd.read_sql_query("""SELECT DISTINCT a.open_emp_id
                     FROM account AS a;""", engine)

   open_emp_id
0           13
1           10
2            1
3           16

# Exercise 4-3
Construct a query that retrieves all accounts opened in 2002.

In [22]:
pd.read_sql_query("""SELECT account_id, open_date
                     FROM account
                     WHERE EXTRACT(YEAR FROM open_date) = 2002;""", engine)

   account_id   open_date
0           7  2002-11-23
1           8  2002-12-15
2          14  2002-08-24
3          24  2002-09-30
4          25  2002-10-01